[
  {
    "name": "Jack M",
    "text": "Let me praise Christy Althage at Classic Travel. Last year, as we were about to leave on our yearly trip to the beach, a large tropical storm was headed to our intended destination.  I called Christy and she arranged two alternate resorts out of harm’s way, in case they were needed.  Thankfully they weren't.  This year, as always, she arranged another wonderful vacation for our family.Christy goes above and beyond to make sure you have a great time.  We are going on an overseas tour with my fraternal group arranged by a different agency.  These people have no clue about customer service.  I happened to mention to Christy how dissatisfied I was with this agency and she provided me with information about my destination and other useful travel tips.,,I tell all my friends, if they need a travel agent, call Christy."
  },
  {
    "name": "Angie G",
    "text": "Christy has helped me plan 3 amazing trips and with each trip she has treated me like I was her number one client. She offered several travel choices, was always available by phone and email, even after hours, and made sure all my questions were addressed. We traveled with no worries and were able to fully enjoy our trips. I loved that she even followed up with us afterwards to ensure our trip was all we expected."
  },
  {
    "name": "Lisa R",
    "text": "Christy helped plan our group vacation from day one! We had four couples going on a cruise with one couple being newbies to the experience. Christy was very knowledgeable with where the best spots on the boat to book the room all the way to great excursion ideas. Our trip had gone down in price and before we could catch that, Christy was on the ball. It was fun to go in and talk to her because she always seemed just as excited as we were for the trip. After the cruise she followed up to check on our experience. I will definitely use Christy to book our travel again!"
  },
  {
    "name": "Maria W",
    "text": "HI CHRISTY, OAHU WITH FRIENDS WAS GREAT !!   OHHH AND OUR CONDO   LOVE LOVE LOVED IT !!!  WILL STAY THERE AGAIN FOR SURE!!   SO THANK U AGAIN FOR ANOTHER AMAZING TRIP!!!!  UR AWESOME ALL UR  SUGGESTION AND PLACES TO STAY ARE REALLY GREAT SO NOW I TRUST U COMPLETELY!!!  THANK U AGAIN "
  },
  {
    "name": "Michelle G",
    "text": "We love using Christy as a travel agent!  She is knowledgable about many different destinations and if she doesn’t know, she’ll quickly find the answer.  Christy is always considerate when booking trips.  She always asks the right questions in finding out what will make our destination the best it can be!  We still can’t believe all of this knowledge, consideration, and caring is FREE! "
  },
  {
    "name": "Maria W",
    "text": "CHRISTY    THANK U  A MILLON  JUST BACK FROM THE MOST AMAZING TRIP WITH MY GRAND KIDS EVER !!!  EVERYTHING WENT OFF WITH OUT A HITCH JUST LIKE U SAID!! BEST TIME EVER!!!  IM SOO PLEASE WITH YOUR SERVICE AND COULD NOT HAVE DONE IT WITH OUT YOUR HELP>  I LOVED THE RESORT WE STAYED AT !!!  THANK U FOR ALWAYS GETTING BACK TO ME WHEN I HAD A MILLON QUESTIONS!!!  "
  },
  {
    "name": "Dan G",
    "text": "We loved it. Very polite staff! Clean rooms w/turn down service each night. We got upgraded to the Diamond room class...but only because i asked. With that room came free room service, and alcohol in room. Beach was small, but plenty manageable. They came around poolside, and to beach for drink service from time to time. We liked just relaxing, so we never left the resort. Restaurants were overall good. I liked the food, and service better than the two places i stayed at in Mexico a few years back. If we go back to O ho Rios ever, we would for sure stay there again. VERY well kept property! We have already recommend it, and will recommend you also. Jenny has actually a few weddings coming up...and they haven't finalized their honeymoon. Thank you so much. Also, we may take a trip to Montana in a year...so we may need some assistance."
  },
  {
    "name": "J & K",
    "text": "Dear Christy, Thank you so much for helping arrange our family reunion in Cancun last week. Everything worked like a charm, including the transfers from our nonstop flights, but the hotel itself and the staff were over the top. You did an outstanding job putting this vacation together for us, and we wanted you to know how much we appreciate your help."
  },
  {
    "name": "Colleen",
    "text": "Hi Christy! Thanks for picking up the phone yesterday and reassuring me that we would get home - all went well at the airport and we had no issues with getting our boarding passes, etc. We truly LOVED this resort!  It was so spacious and accommodating and the staff were incredible.  The beach was so long and beautiful and clean.  This is now elevated to the top resort I've been to in Mexico! Thanks for all your help throughout this process - you made it all so easy and diligently and courteously answered all of my questions along the way and I appreciate it so much. "
  }
]